---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementIdSetFilter
source: html/afa321db-d575-0850-7a4c-02c1586ed7d1.htm
---
# ElementIdSetFilter Members

Constructs a new instance of a filter wrapping a set of elements.